app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at DESC
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" IS NULL AND "likes"."post_id" = 3
---
                                      <div id="<%=post.id%>">
                                      <%if Like.where(user:current_user, post:post).count>0%>